# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv11m with GAM attention in the neck after top-down fusions

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv11m backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [128, 3, 2]] # 0
  - [-1, 1, Conv, [256, 3, 2]] # 1
  - [-1, 2, C3k2, [512, False, 0.25]] # 2
  - [-1, 1, Conv, [512, 3, 2]] # 3
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, SPPF, [512, 5]] # 9
  - [-1, 2, C2PSA, [512]] # 10

# YOLOv11m head (indices adjusted for two new GAM layers)
head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 1, GAM, []]             # 13 <-- ADDED GAM
  - [-1, 2, C3k2, [512, False]] # 14 (P4-head)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16
  - [-1, 1, GAM, []]             # 17 <-- ADDED GAM
  - [-1, 2, C3k2, [256, False]] # 18 (P3-small output)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 14], 1, Concat, [1]] # 20: Connects to P4-head
  - [-1, 2, C3k2, [512, False]] # 21 (P4-medium output)

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 10], 1, Concat, [1]] # 23: Connects to backbone P5-head
  - [-1, 2, C3k2, [512, True]] # 24 (P5-large output)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect from P3, P4, and P5 heads