# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv11m with GAM attention at the end of the backbone

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv11m backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [128, 3, 2]] # 0
  - [-1, 1, Conv, [256, 3, 2]] # 1
  - [-1, 2, C3k2, [512, False, 0.25]] # 2
  - [-1, 1, Conv, [512, 3, 2]] # 3
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, SPPF, [512, 5]] # 9
  - [-1, 2, C2PSA, [512]] # 10
  - [-1, 1, GAM, []]             # 11 <-- ADDED GAM BLOCK

# YOLOv11m head (indices adjusted for new backbone length)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]] # 13
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [256, False]] # 17 (P3-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19
  - [-1, 2, C3k2, [512, False]] # 20 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22: Connects to new backbone end (GAM)
  - [-1, 2, C3k2, [512, True]] # 23 (P5-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)