# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv11n with SimAM attention

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLOv11n head (indices are relative, so no changes needed)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                 # 12
  - [-1, 1, SimAM, []]                        # 13 <-- NEW
  - [-1, 2, C3k2, [512, False]]               # 14 (P4-head)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                 # 16
  - [-1, 2, C3k2, [256, False]]               # 17 (P3-small output)

  - [-1, 1, Conv, [256, 3, 2]]                # 18
  - [[-1, 14], 1, Concat, [1]]                # 19 (Connects to P4-head)
  - [-1, 2, C3k2, [512, False]]               # 20 (P4-medium output)

  - [-1, 1, Conv, [512, 3, 2]]                # 21
  - [[-1, 10], 1, Concat, [1]]                # 22 (Connects to backbone P5-head)
  - [-1, 2, C3k2, [1024, True]]               # 23 (P5-large output)

  - [[17, 20, 23], 1, Segment, [nc, 32, 256]]           # Corrected Detect Layer
